/*
 * @Author: zhangping
 * @Date: 2026-04-27 10:56:54
 * @Description: 菜单名称-模块名称
 */

import React, { useEffect } from 'react';
import { marked } from 'marked';
import styles from './index.module.less';

const content =
    '**查询条件：**  \n- 时间：2026-04-01 至 2026-04-30  \n- 时间维度：日  \n- 花纹：EV505（id=[EV505]）  \n- 行-产品类别：花纹  \n- 列-客户类别：合计不分类  \n\n**EV505当前月每日的销售订单数量：**\n\n| 日期       | 订单数量 |\n|------------|----------|\n| 2026-04-01 | 10       |\n| 2026-04-02 | 180      |\n| 2026-04-03 | 100      |\n| 2026-04-04 | 0        |\n| 2026-04-05 | 0        |\n| 2026-04-06 | 180      |\n| 2026-04-07 | 70       |\n| 2026-04-08 | 60       |\n| 2026-04-09 | 70       |\n| 2026-04-10 | 90       |\n| 2026-04-11 | 170      |\n| 2026-04-12 | 0        |\n| 2026-04-13 | 252      |\n| 2026-04-14 | 219      |\n| 2026-04-15 | 264      |\n| 2026-04-16 | 0        |\n| 2026-04-17 | 0        |\n| 2026-04-18 | 44       |\n| 2026-04-19 | 0        |\n| 2026-04-20 | 90       |\n| 2026-04-21 | 160      |\n| 2026-04-22 | 216      |\n| 2026-04-23 | 10       |\n| 2026-04-24 | 84       |\n| 2026-04-25 | 340      |\n| 2026-04-26 | 0        |\n| 2026-04-27 | 114      |\n| 2026-04-28 | 0        |\n| 2026-04-29 | 0        |\n| 2026-04-30 | 0        |';

const Index = () => {
    return (
        <div className={styles['box']}>
            <div
                dangerouslySetInnerHTML={{ __html: marked.parse(`${content}`) }}
                className={styles['markdownBody']}
            ></div>
        </div>
    );
};

export default Index;
